console.log('0.1 + 0.2 === 0.3', 0.1 + 0.2 === 0.3); // false
console.log('0.1 + 0.2', 0.1 + 0.2); // 0.30000000000000004

console.log('вирішення проблеми залишку');
console.log(
  'Перший спосіб - зробити числа цілими, помноживши, на N, а потім поділивши результат також на N',
);
console.log('0.17 + 0.24', 0.17 + 0.24); // 0.41000000000000003
console.log('(0.17 * 100 + 0.24 * 100) / 100', (0.17 * 100 + 0.24 * 100) / 100); // 0.41

console.log(
  'Другий спосіб - додати, а результат скоротити до певного знаку після коми за допомогою методу toFixed().',
);
console.log('(0.17 + 0.24).toFixed(2)', (0.17 + 0.24).toFixed(2)); // 0.41

// Клас Math​
// Math.floor(num) - повертає найменше ціле число менше, або яке дорівнює зазначеному числу
console.log('Math.floor(1.7)', Math.floor(1.7)); // 1

// Math.ceil(num) - повертає найбільше ціле число більше, або яке дорівнює зазначеному числу.
console.log('Math.ceil(1.2)', Math.ceil(1.2)); // 2

// Math.round(num) - повертає значення числа, округленого до найближчого цілого
console.log('Math.round(1.2)', Math.round(1.2)); // 1
console.log('Math.round(1.5)', Math.round(1.5)); // 2

// Math.max(num1, num2, ...) - повертає найбільше ціле число з набору
console.log('Math.max(20, 10, 50, 40)', Math.max(20, 10, 50, 40)); // 50

// Math.min(num1, num2, ...) - повертає найменше ціле число з набору
console.log('Math.min(20, 10, 50, 40)', Math.min(20, 10, 50, 40)); // 10

// Math.pow(base, exponent) - піднесення до степеня
console.log('Math.pow(2, 4)', Math.pow(2, 4)); // 16

// Math.random() - повертає псевдовипадкове число в діапазоні [0, 1)
console.log('Math.random() - випадкове число між 0 і 1', Math.random()); // випадкове число між 0 і 1
console.log(
  'Math.random() * (10 - 1) + 1 - псевдовипадкове число від 1 до 10',
  Math.random() * (10 - 1) + 1,
); // псевдовипадкове число від 1 до 10
