console.log(
  "6 хибних(falsy) значень, що приводяться до false у логічному перетворенні: 0, NaN, null, undefined, порожній рядок і false.",
);
console.log("Абсолютно все інше приводиться до true.");
console.log(
  "логічне І: вираз && вираз - повертає значення першого операнду, який дорівнює false, або останній, якщо усі true",
);
console.log(
  "Виконуючи логічне «І», правий операнд може не обчислюватися у випадку, якщо лівий був приведений до false.",
);

console.log("Логічне «АБО»");
console.log(
  "повертає значення першого операнду, який дорівнює true, або останній, якщо усі false",
);

// Виконуючи логічне «АБО», правий операнд може не обчислюватися у випадку, якщо лівий був приведений до true.
